MikroElektronika/core_packages/PIC/XC8/def/PIC18F66J11/mcu.h
#define                                 OSCFIE_bit          _BIT_ACCESS(PIE2,7)
// PIR2<OSCFIF>
extern volatile __bit                   OSCFIF              __at(0x7D0F);	// @ (0xFA1 * 8 + 7)
#define                                 OSCFIF_bit          _BIT_ACCESS(PIR2,7)
// IPR2<OSCFIP>
extern volatile __bit                   OSCFIP              __at(0x7D17);	// @ (0xFA2 * 8 + 7)
#define                                 OSCFIP_bit          _BIT_ACCESS(IPR2,7)
// OSCCON<OSTS>
extern volatile __bit                   OSTS                __at(0x7E9B);	// @ (0xFD3 * 8 + 3)
#define                                 OSTS_bit            _BIT_ACCESS(OSCCON,3)
// STATUS<OV>
extern volatile __bit                   OV                  __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OV_bit              _BIT_ACCESS(STATUS,3)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// ECCP1DEL<P1DC0>
extern volatile __bit                   P1DC0               __at(0x7DF0);	// @ (0xFBE * 8 + 0)
#define                                 P1DC0_bit           _BIT_ACCESS(ECCP1DEL,0)
// ECCP1DEL<P1DC1>
extern volatile __bit                   P1DC1               __at(0x7DF1);	// @ (0xFBE * 8 + 1)
#define                                 P1DC1_bit           _BIT_ACCESS(ECCP1DEL,1)
// ECCP1DEL<P1DC2>
extern volatile __bit                   P1DC2               __at(0x7DF2);	// @ (0xFBE * 8 + 2)
#define                                 P1DC2_bit           _BIT_ACCESS(ECCP1DEL,2)
// ECCP1DEL<P1DC3>
extern volatile __bit                   P1DC3               __at(0x7DF3);	// @ (0xFBE * 8 + 3)
#define                                 P1DC3_bit           _BIT_ACCESS(ECCP1DEL,3)
// ECCP1DEL<P1DC4>
extern volatile __bit                   P1DC4               __at(0x7DF4);	// @ (0xFBE * 8 + 4)
#define                                 P1DC4_bit           _BIT_ACCESS(ECCP1DEL,4)
// ECCP1DEL<P1DC5>
extern volatile __bit                   P1DC5               __at(0x7DF5);	// @ (0xFBE * 8 + 5)
#define                                 P1DC5_bit           _BIT_ACCESS(ECCP1DEL,5)
// ECCP1DEL<P1DC6>
extern volatile __bit                   P1DC6               __at(0x7DF6);	// @ (0xFBE * 8 + 6)
#define                                 P1DC6_bit           _BIT_ACCESS(ECCP1DEL,6)
// ECCP1CON<P1M0>
extern volatile __bit                   P1M0                __at(0x7DDE);	// @ (0xFBB * 8 + 6)
#define                                 P1M0_bit            _BIT_ACCESS(ECCP1CON,6)
// ECCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x7DDF);	// @ (0xFBB * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(ECCP1CON,7)
// ECCP1DEL<P1RSEN>
extern volatile __bit                   P1RSEN              __at(0x7DF7);	// @ (0xFBE * 8 + 7)
#define                                 P1RSEN_bit          _BIT_ACCESS(ECCP1DEL,7)
// SSP2STAT<P2>
extern volatile __bit                   P2                  __at(0x7B6C);	// @ (0xF6D * 8 + 4)
#define                                 P2_bit              _BIT_ACCESS(SSP2STAT,4)
// ECCP2DEL<P2DC0>
extern volatile __bit                   P2DC0               __at(0x7DC8);	// @ (0xFB9 * 8 + 0)
#define                                 P2DC0_bit           _BIT_ACCESS(ECCP2DEL,0)
// ECCP2DEL<P2DC1>
extern volatile __bit                   P2DC1               __at(0x7DC9);	// @ (0xFB9 * 8 + 1)
#define                                 P2DC1_bit           _BIT_ACCESS(ECCP2DEL,1)
// ECCP2DEL<P2DC2>
extern volatile __bit                   P2DC2               __at(0x7DCA);	// @ (0xFB9 * 8 + 2)
#define                                 P2DC2_bit           _BIT_ACCESS(ECCP2DEL,2)
// ECCP2DEL<P2DC3>
extern volatile __bit                   P2DC3               __at(0x7DCB);	// @ (0xFB9 * 8 + 3)
#define                                 P2DC3_bit           _BIT_ACCESS(ECCP2DEL,3)
// ECCP2DEL<P2DC4>
extern volatile __bit                   P2DC4               __at(0x7DCC);	// @ (0xFB9 * 8 + 4)
#define                                 P2DC4_bit           _BIT_ACCESS(ECCP2DEL,4)
// ECCP2DEL<P2DC5>
extern volatile __bit                   P2DC5               __at(0x7DCD);	// @ (0xFB9 * 8 + 5)
#define                                 P2DC5_bit           _BIT_ACCESS(ECCP2DEL,5)
// ECCP2DEL<P2DC6>
extern volatile __bit                   P2DC6               __at(0x7DCE);	// @ (0xFB9 * 8 + 6)
#define                                 P2DC6_bit           _BIT_ACCESS(ECCP2DEL,6)
// ECCP2CON<P2M0>
extern volatile __bit                   P2M0                __at(0x7DB6);	// @ (0xFB6 * 8 + 6)
#define                                 P2M0_bit            _BIT_ACCESS(ECCP2CON,6)
// ECCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 P2M1_bit            _BIT_ACCESS(ECCP2CON,7)
// ECCP2DEL<P2RSEN>
extern volatile __bit                   P2RSEN              __at(0x7DCF);	// @ (0xFB9 * 8 + 7)
#define                                 P2RSEN_bit          _BIT_ACCESS(ECCP2DEL,7)
// ECCP3DEL<P3DC0>
extern volatile __bit                   P3DC0               __at(0x7DA0);	// @ (0xFB4 * 8 + 0)
#define                                 P3DC0_bit           _BIT_ACCESS(ECCP3DEL,0)
// ECCP3DEL<P3DC1>
extern volatile __bit                   P3DC1               __at(0x7DA1);	// @ (0xFB4 * 8 + 1)
#define                                 P3DC1_bit           _BIT_ACCESS(ECCP3DEL,1)
// ECCP3DEL<P3DC2>
extern volatile __bit                   P3DC2               __at(0x7DA2);	// @ (0xFB4 * 8 + 2)
#define                                 P3DC2_bit           _BIT_ACCESS(ECCP3DEL,2)
// ECCP3DEL<P3DC3>
extern volatile __bit                   P3DC3               __at(0x7DA3);	// @ (0xFB4 * 8 + 3)
#define                                 P3DC3_bit           _BIT_ACCESS(ECCP3DEL,3)
// ECCP3DEL<P3DC4>
extern volatile __bit                   P3DC4               __at(0x7DA4);	// @ (0xFB4 * 8 + 4)
#define                                 P3DC4_bit           _BIT_ACCESS(ECCP3DEL,4)
// ECCP3DEL<P3DC5>
extern volatile __bit                   P3DC5               __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 P3DC5_bit           _BIT_ACCESS(ECCP3DEL,5)
// ECCP3DEL<P3DC6>
extern volatile __bit                   P3DC6               __at(0x7DA6);	// @ (0xFB4 * 8 + 6)
#define                                 P3DC6_bit           _BIT_ACCESS(ECCP3DEL,6)
// ECCP3CON<P3M0>
extern volatile __bit                   P3M0                __at(0x7D8E);	// @ (0xFB1 * 8 + 6)
#define                                 P3M0_bit            _BIT_ACCESS(ECCP3CON,6)
// ECCP3CON<P3M1>
extern volatile __bit                   P3M1                __at(0x7D8F);	// @ (0xFB1 * 8 + 7)
#define                                 P3M1_bit            _BIT_ACCESS(ECCP3CON,7)
// ECCP3DEL<P3RSEN>
extern volatile __bit                   P3RSEN              __at(0x7DA7);	// @ (0xFB4 * 8 + 7)
#define                                 P3RSEN_bit          _BIT_ACCESS(ECCP3DEL,7)
// PORTC<PA1>
extern volatile __bit                   _PA1                 __at(0x7C12);	// @ (0xF82 * 8 + 2)  // Note: Changed by MikroE
#define                                 PA1_bit             _BIT_ACCESS(PORTC,2)
// PORTC<PA2>
extern volatile __bit                   _PA2                 __at(0x7C11);	// @ (0xF82 * 8 + 1)  // Note: Changed by MikroE
#define                                 PA2_bit             _BIT_ACCESS(PORTC,1)
// PORTE<PA2E>
extern volatile __bit                   PA2E                __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 PA2E_bit            _BIT_ACCESS(PORTE,7)
// PORTE<PB1E>
extern volatile __bit                   PB1E                __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 PB1E_bit            _BIT_ACCESS(PORTE,6)
// PORTE<PB2>
extern volatile __bit                   _PB2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)  // Note: Changed by MikroE
#define                                 PB2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<PB3E>
extern volatile __bit                   PB3E                __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 PB3E_bit            _BIT_ACCESS(PORTE,4)
// PORTE<PC1E>
extern volatile __bit                   PC1E                __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 PC1E_bit            _BIT_ACCESS(PORTE,5)
// PORTE<PC2>
extern volatile __bit                   _PC2                 __at(0x7C21);	// @ (0xF84 * 8 + 1)  // Note: Changed by MikroE
#define                                 PC2_bit             _BIT_ACCESS(PORTE,1)
// PORTE<PC3E>
extern volatile __bit                   PC3E                __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 PC3E_bit            _BIT_ACCESS(PORTE,3)
// ANCON0<PCFG0>
extern volatile __bit                   PCFG0               __at(0x7E08);	// @ (0xFC1 * 8 + 0)
#define                                 PCFG0_bit           _BIT_ACCESS(ANCON0,0)
// ANCON0<PCFG1>
extern volatile __bit                   PCFG1               __at(0x7E09);	// @ (0xFC1 * 8 + 1)
#define                                 PCFG1_bit           _BIT_ACCESS(ANCON0,1)
// ANCON1<PCFG10>
extern volatile __bit                   PCFG10              __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 PCFG10_bit          _BIT_ACCESS(ANCON1,2)
// ANCON1<PCFG11>
extern volatile __bit                   PCFG11              __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 PCFG11_bit          _BIT_ACCESS(ANCON1,3)
// ANCON1<PCFG12>
extern volatile __bit                   PCFG12              __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 PCFG12_bit          _BIT_ACCESS(ANCON1,4)
// ANCON1<PCFG13>
extern volatile __bit                   PCFG13              __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 PCFG13_bit          _BIT_ACCESS(ANCON1,5)
// ANCON1<PCFG14>
extern volatile __bit                   PCFG14              __at(0x7E16);	// @ (0xFC2 * 8 + 6)
#define                                 PCFG14_bit          _BIT_ACCESS(ANCON1,6)
// ANCON1<PCFG15>
extern volatile __bit                   PCFG15              __at(0x7E17);	// @ (0xFC2 * 8 + 7)
#define                                 PCFG15_bit          _BIT_ACCESS(ANCON1,7)
// ANCON0<PCFG2>
extern volatile __bit                   PCFG2               __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 PCFG2_bit           _BIT_ACCESS(ANCON0,2)
// ANCON0<PCFG3>
extern volatile __bit                   PCFG3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 PCFG3_bit           _BIT_ACCESS(ANCON0,3)
// ANCON0<PCFG4>
extern volatile __bit                   PCFG4               __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 PCFG4_bit           _BIT_ACCESS(ANCON0,4)
// ANCON0<PCFG5>
extern volatile __bit                   PCFG5               __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 PCFG5_bit           _BIT_ACCESS(ANCON0,5)
// ANCON0<PCFG6>
extern volatile __bit                   PCFG6               __at(0x7E0E);	// @ (0xFC1 * 8 + 6)
#define                                 PCFG6_bit           _BIT_ACCESS(ANCON0,6)
// ANCON0<PCFG7>
extern volatile __bit                   PCFG7               __at(0x7E0F);	// @ (0xFC1 * 8 + 7)
#define                                 PCFG7_bit           _BIT_ACCESS(ANCON0,7)
// ANCON1<PCFG8>
extern volatile __bit                   PCFG8               __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 PCFG8_bit           _BIT_ACCESS(ANCON1,0)
// ANCON1<PCFG9>
extern volatile __bit                   PCFG9               __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 PCFG9_bit           _BIT_ACCESS(ANCON1,1)
// RCON<PD>
extern volatile __bit                   PD                  __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 PD_bit              _BIT_ACCESS(RCON,2)
// PORTE<PD2>
extern volatile __bit                   _PD2                 __at(0x7C20);	// @ (0xF84 * 8 + 0)  // Note: Changed by MikroE
#define                                 PD2_bit             _BIT_ACCESS(PORTE,0)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// INTCON<PEIE_GIEL>
extern volatile __bit                   PEIE_GIEL           __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_GIEL_bit       _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit _DEPRECATED       PEN                 __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSP1CON2,2)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<PEN2>
extern volatile __bit                   PEN2                __at(0x7B5A);	// @ (0xF6B * 8 + 2)
#define                                 PEN2_bit            _BIT_ACCESS(SSP2CON2,2)
// PORTB<PGC>
extern volatile __bit                   PGC                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 PGC_bit             _BIT_ACCESS(PORTB,6)
// PORTB<PGD>
extern volatile __bit                   PGD                 __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 PGD_bit             _BIT_ACCESS(PORTB,7)
// OSCTUNE<PLLEN>
extern volatile __bit                   PLLEN               __at(0x7CDE);	// @ (0xF9B * 8 + 6)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCTUNE,6)
// PORTB<PMA0>
extern volatile __bit                   PMA0                __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 PMA0_bit            _BIT_ACCESS(PORTB,5)
// PORTB<PMA1>
extern volatile __bit                   PMA1                __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 PMA1_bit            _BIT_ACCESS(PORTB,4)
// PORTE<PMA10>
extern volatile __bit                   PMA10               __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 PMA10_bit           _BIT_ACCESS(PORTE,6)
// PORTE<PMA11>
extern volatile __bit                   PMA11               __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 PMA11_bit           _BIT_ACCESS(PORTE,5)
// PORTE<PMA12>
extern volatile __bit                   PMA12               __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 PMA12_bit           _BIT_ACCESS(PORTE,4)
// PORTE<PMA13>
extern volatile __bit                   PMA13               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 PMA13_bit           _BIT_ACCESS(PORTE,3)
// PORTB<PMA2>
extern volatile __bit                   PMA2                __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 PMA2_bit            _BIT_ACCESS(PORTB,3)
// PORTB<PMA3>
extern volatile __bit                   PMA3                __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 PMA3_bit            _BIT_ACCESS(PORTB,2)
// PORTB<PMA4>
extern volatile __bit                   PMA4                __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 PMA4_bit            _BIT_ACCESS(PORTB,1)
// PORTF<PMA5>
extern volatile __bit                   PMA5                __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 PMA5_bit            _BIT_ACCESS(PORTF,2)
// PORTG<PMA6>
extern volatile __bit                   PMA6                __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 PMA6_bit            _BIT_ACCESS(PORTG,2)
// PORTG<PMA7>
extern volatile __bit                   PMA7                __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 PMA7_bit            _BIT_ACCESS(PORTG,1)
// PORTG<PMA8>
extern volatile __bit                   PMA8                __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 PMA8_bit            _BIT_ACCESS(PORTG,0)
// PORTE<PMA9>
extern volatile __bit                   PMA9                __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 PMA9_bit            _BIT_ACCESS(PORTE,7)
// PORTE<PMBE>
extern volatile __bit                   PMBE                __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 PMBE_bit            _BIT_ACCESS(PORTE,2)
// PORTG<PMCS1>
extern volatile __bit                   PMCS1               __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 PMCS1_bit           _BIT_ACCESS(PORTG,3)
// PORTG<PMCS2>
extern volatile __bit                   PMCS2               __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 PMCS2_bit           _BIT_ACCESS(PORTG,4)
// PORTD<PMD0>
extern volatile __bit                   PMD0                __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 PMD0_bit            _BIT_ACCESS(PORTD,0)
// PORTD<PMD1>
extern volatile __bit                   PMD1                __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 PMD1_bit            _BIT_ACCESS(PORTD,1)
// PORTD<PMD2>
extern volatile __bit                   PMD2                __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 PMD2_bit            _BIT_ACCESS(PORTD,2)
// PORTD<PMD3>
extern volatile __bit                   PMD3                __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 PMD3_bit            _BIT_ACCESS(PORTD,3)
// PORTD<PMD4>
extern volatile __bit                   PMD4                __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 PMD4_bit            _BIT_ACCESS(PORTD,4)
// PORTD<PMD5>
extern volatile __bit                   PMD5                __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 PMD5_bit            _BIT_ACCESS(PORTD,5)
// PORTD<PMD6>
extern volatile __bit                   PMD6                __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 PMD6_bit            _BIT_ACCESS(PORTD,6)
// PORTD<PMD7>
extern volatile __bit                   PMD7                __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 PMD7_bit            _BIT_ACCESS(PORTD,7)
// PMCONH<PMPEN>
extern volatile __bit                   PMPEN               __at(0x7B2F);	// @ (0xF65 * 8 + 7)
#define                                 PMPEN_bit           _BIT_ACCESS(PMCONH,7)
// PIE1<PMPIE>
extern volatile __bit                   PMPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PMPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PMPIF>
extern volatile __bit                   PMPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PMPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PMPIP>
extern volatile __bit                   PMPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PMPIP_bit           _BIT_ACCESS(IPR1,7)
// PADCFG1<PMPTL>
extern volatile __bit                   PMPTL               __at(0x7E60);	// @ (0xFCC * 8 + 0)
#define                                 PMPTL_bit           _BIT_ACCESS(PADCFG1,0)
// PADCFG1<PMPTTL>
extern volatile __bit                   PMPTTL              __at(0x7E60);	// @ (0xFCC * 8 + 0)
#define                                 PMPTTL_bit          _BIT_ACCESS(PADCFG1,0)
// PORTE<PMRD>
extern volatile __bit                   PMRD                __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 PMRD_bit            _BIT_ACCESS(PORTE,0)
// PORTE<PMWR>
extern volatile __bit                   PMWR                __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 PMWR_bit            _BIT_ACCESS(PORTE,1)
// RCON<POR>
extern volatile __bit                   POR                 __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(RCON,1)
// T0CON<PSA>
extern volatile __bit                   PSA                 __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(T0CON,3)
// PMCONH<PSIDL>
extern volatile __bit                   PSIDL               __at(0x7B2D);	// @ (0xF65 * 8 + 5)
#define                                 PSIDL_bit           _BIT_ACCESS(PMCONH,5)
// PIE1<PSPIE>
extern volatile __bit                   PSPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PSPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PSPIF>
extern volatile __bit                   PSPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PSPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PSPIP>
extern volatile __bit                   PSPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PSPIP_bit           _BIT_ACCESS(IPR1,7)
// ECCP1AS<PSS1AC0>
extern volatile __bit                   PSS1AC0             __at(0x7DFA);	// @ (0xFBF * 8 + 2)
#define                                 PSS1AC0_bit         _BIT_ACCESS(ECCP1AS,2)
// ECCP1AS<PSS1AC1>
extern volatile __bit                   PSS1AC1             __at(0x7DFB);	// @ (0xFBF * 8 + 3)
#define                                 PSS1AC1_bit         _BIT_ACCESS(ECCP1AS,3)
// ECCP1AS<PSS1BD0>
extern volatile __bit                   PSS1BD0             __at(0x7DF8);	// @ (0xFBF * 8 + 0)
#define                                 PSS1BD0_bit         _BIT_ACCESS(ECCP1AS,0)
// ECCP1AS<PSS1BD1>
extern volatile __bit                   PSS1BD1             __at(0x7DF9);	// @ (0xFBF * 8 + 1)
#define                                 PSS1BD1_bit         _BIT_ACCESS(ECCP1AS,1)
// ECCP2AS<PSS2AC0>
extern volatile __bit                   PSS2AC0             __at(0x7DD2);	// @ (0xFBA * 8 + 2)
#define                                 PSS2AC0_bit         _BIT_ACCESS(ECCP2AS,2)
// ECCP2AS<PSS2AC1>
extern volatile __bit                   PSS2AC1             __at(0x7DD3);	// @ (0xFBA * 8 + 3)
#define                                 PSS2AC1_bit         _BIT_ACCESS(ECCP2AS,3)
// ECCP2AS<PSS2BD0>
extern volatile __bit                   PSS2BD0             __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 PSS2BD0_bit         _BIT_ACCESS(ECCP2AS,0)
// ECCP2AS<PSS2BD1>
extern volatile __bit                   PSS2BD1             __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 PSS2BD1_bit         _BIT_ACCESS(ECCP2AS,1)
// ECCP3AS<PSS3AC0>
extern volatile __bit                   PSS3AC0             __at(0x7DAA);	// @ (0xFB5 * 8 + 2)
#define                                 PSS3AC0_bit         _BIT_ACCESS(ECCP3AS,2)
// ECCP3AS<PSS3AC1>
extern volatile __bit                   PSS3AC1             __at(0x7DAB);	// @ (0xFB5 * 8 + 3)
#define                                 PSS3AC1_bit         _BIT_ACCESS(ECCP3AS,3)
// ECCP3AS<PSS3BD0>
extern volatile __bit                   PSS3BD0             __at(0x7DA8);	// @ (0xFB5 * 8 + 0)
#define                                 PSS3BD0_bit         _BIT_ACCESS(ECCP3AS,0)
// ECCP3AS<PSS3BD1>
extern volatile __bit                   PSS3BD1             __at(0x7DA9);	// @ (0xFB5 * 8 + 1)
#define                                 PSS3BD1_bit         _BIT_ACCESS(ECCP3AS,1)
// PMCONH<PTBEEN>
